In [1]:
import pandas as pd
# import psycopg2 as psy
import sqlalchemy # Thư viện dành cho hiển thị sql trong file

# Import thư viện kết nối với postgresql
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:98919891@153.92.214.210:5432/er_sample')

# Bắt đầu cho phép sử dụng sql trong dòng lệnh
%load_ext sql

# Khởi tạo kết nối với server database
%sql postgresql://postgres:98919891@153.92.214.210:5432/er_sample

<h1>CHAPTER 17<h1/>

1 職種毎の会員の人数が 2 人以上いる職種の一覧を表示しなさい。結果表は「職種 ID」、「職種名」、「人数」を見出
しとして表示しなさい。表示順は人数の多い順、人数が同一の場合は職種 ID 順とする。

In [11]:
%%sql
/*
+ Lấy thông tin:  
     mã nghề: 職種 ID
    ,tên nghề: 職種名
    ,đếm số người làm nghề theo mã nghề: 人数
+ Tại bảng
    member
    ,job_type  
+ Điều kiện: 
    là các mã có số người lớn hơn 2    
+ Hiển thị:
    theo số lượng người giảm dần
    , TH số lượng như nhau thì sắp xếp theo mã nghề
*/
SELECT
    m.job_type_id AS "職種 ID"
    ,jt.job_type_name AS "職種名"
    ,COUNT(*) AS "人数"
FROM
    member AS m
    INNER JOIN job_type AS jt
        ON m.job_type_id = jt.job_type_id
GROUP BY
    m.job_type_id
    ,jt.job_type_name
HAVING
    COUNT(*) >=2
ORDER BY 
    COUNT(*) DESC
    ,m.job_type_id ASC
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
3 rows affected.

[('JT003', '技術', 3), ('JT002', '管理', 2), ('JT004', '生産・製造', 2)]

2 業種毎の会員の人数を一覧表示しなさい。結果表は「業種 ID」、「業種名」、「人数」を見出しとして表示しなさい。
ただし、会員が存在しない業種も表示しなさい。また、業種が未定の会員については、「未定」の業種名に人数を
表示しなさい。

In [20]:
%%sql
/*
+ Lấy thông tin:  
     mã ngành kinh doanh: 業種 ID
    ,tên ngành kinh doanh: 業種名
    ,đếm số người làm nghề theo mã ngành: 人数
+ Tại bảng
    member
    ,business_type  
+ Điều kiện: 
      
+ Hiển thị:
    Hiển thị cả những ngành không tồn tại người tham gia
    ,các thành viên không có ngành xác định thì hiển thị '未定'
*/
SELECT
    -- Chọn hiển thị '未定' với các thành viên có ngành nghề không xác định
    CASE 
    WHEN m.business_type_id <> 'None' THEN m.business_type_id
    ELSE '未定'
    END AS "業種ID"
    
    -- Chọn hiển thị '未定' với các thành viên có ngành nghề không xác định
    ,CASE 
    WHEN m.business_type_id <> 'None' THEN bt.business_type_name
    ELSE '未定'
    END AS "業種名"
    
    ,COUNT(*) AS "人数"
FROM
    member AS m
    LEFT JOIN business_type AS bt
        ON m.business_type_id = bt.business_type_id
GROUP BY
    m.business_type_id
    ,bt.business_type_name
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
12 rows affected.

[('未定', '未定', 2),
 ('BT007', '会計・税理', 1),
 ('BT013', '小売業', 1),
 ('BT011', '学生', 2),
 ('BT002', '電気機器関連', 1),
 ('BT005', 'マスコミ', 1),
 ('BT003', '金融・証券・保険', 1),
 ('BT006', '出版', 1),
 ('BT009', '教員', 1),
 ('BT008', '公務員・官公庁', 1),
 ('BT012', '製造業', 1),
 ('BT001', 'コンピュータ関連', 1)]

3 全ての書籍の中で発売日が最も古い書籍の書籍 ID、書籍名、発売日の一覧を、結果表の見出しが「書籍 ID」、
「書籍名」、「発売日」となるように表示しなさい。

In [46]:
%%sql
/*
+ Lấy thông tin:  
     mã sách: 書籍 ID
    ,tên sách: 書籍名
    ,ngày bán: 発売日
+ Tại bảng
    book,  
+ Điều kiện: 
    ngày bán cũ nhất : on_sale_date MIN
+ Hiển thị:
*/
SELECT
    book_id AS "書籍 ID"
    ,book_name AS "書籍名"
    ,on_sale_date AS "発売日"
FROM
    book 
WHERE
    on_sale_date = (SELECT
                        MIN(on_sale_date) 
                    FROM 
                        book
                    )
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
2 rows affected.

[('B0000016', 'エジソン', datetime.date(1998, 2, 1)),
 ('B0000022', 'アインシュタイン', datetime.date(1998, 2, 1))]

4 2011 年 4 月以降の注文の中で、2 冊以上の書籍を注文しているもののみを注文番号順に一覧表示しなさい。結
果表は「注文番号」、「注文日時」、「注文者の氏名」、「注文冊数」を見出しとして表示しなさい。

In [11]:
%%sql
/*
+ Lấy thông tin:  
     mã đơn đặt hàng:  注文番号
    ,thời gian đặt hàng: 注文日時
    ,tên người đặt hàng: 注文者の氏名
    ,số lượng hàng được đặt: 注文冊数
+ Tại bảng:
    order_detail
    ,order_header
    ,member
+ Điều kiện: 
    Thời gian đặt hàng sau ngày 2011-04-01 
    , số lượng 注文冊数 >= 2 cuốn
+ Hiển thị:
    Hiển thị theo 注文番号
*/
SELECT
    od.order_no AS "注文番号"
    ,oh.order_datetime AS "注文日時"
    ,m.first_name || m.last_name AS "注文者の氏名"
    ,od.item_num AS "注文冊数"
FROM
    order_detail AS od
    LEFT JOIN order_header AS oh
        ON od.order_no = oh.order_no
    LEFT JOIN member AS m
        ON oh.member_id = m.member_id      
WHERE
    (od.item_num >= 2)
    AND
    (oh.order_datetime >= '2011-04-01')
ORDER BY 
     od.order_no
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
3 rows affected.

[('OD000013', datetime.datetime(2011, 9, 22, 18, 44, 29), '裕子田中', 3),
 ('OD000021', datetime.datetime(2011, 10, 20, 9, 50, 11), '一郎森山', 3),
 ('OD000025', datetime.datetime(2011, 10, 24, 19, 39, 31), '武斉藤', 2)]

5 会員毎の 2011 年 1 月 1 日以降の合計購入金額が 5000 円以上の会員一覧を作成しなさい。結果表は「会員
ID」、「氏名」、「購入金額合計」を見出しとして表示しなさい。※書籍1冊分の購入金額は「書籍の価格-値引き金
額」で求めることとする。

In [8]:
%%sql
/*
+ Lấy thông tin:  
     mã thành viên: 会員 ID
    ,tên thành viên: 氏名
    ,tổng tiền mua: 購入金額合計
+ Tại bảng
    book, order_detail, order_header, member 
+ Điều kiện: 
    ngày bán cũ nhất : mua tính từ 2011/1/1 trở về sau
    Tổng giá trị mua từ 5000 yên trở lên
+ Hiển thị:
+ Tham khảo:
    Giá mua = Giá gốc - giảm giá
*/
SELECT
    oh.member_id AS "会員 ID"
    ,m.first_name || m.last_name AS "氏名"
    ,SUM(b.price - b.discount) AS "購入金額合計"
FROM
    order_detail AS od
    INNER JOIN book AS b
        ON od.item_id = b.book_id
    INNER JOIN order_header AS oh
        ON oh.order_no = od.order_no
    LEFT JOIN member AS m
        ON oh.member_id = m.member_id
GROUP BY 
    oh.member_id
    ,氏名
    ,oh.order_datetime
HAVING 
    oh.order_datetime >= '2011-01-01'
    AND
    SUM(b.price - b.discount) >= 5000
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
1 rows affected.

[('M004', '武斉藤', 10880)]

6 会員が持つクレジットカードの中から、クレジットカード会社毎に有効期限が最も未来のものを一覧表示しなさい。
結果表は「クレジットカード会社 ID」、「クレジット会社名」、「有効期限(YY/MM)」、「カード番号」、「会員 ID」、「氏
名」を見出しとして表示しなさい。

In [6]:
%%sql
/*
+ Lấy thông tin:  
     mã cty thẻ: クレジットカード会社 ID
    ,tên cty thẻ: クレジット会社名
    ,hạn sử dụng thẻ: 有効期限(YY/MM)
    ,số thẻ: カード番号
    ,mã số hội viên: 会員 ID
    ,tên hội viên: 氏名
+ Tại bảng
    member, member_card, card_company 
+ Điều kiện: 
    ngày còn hạn sử dụng lâu nhất
+ Hiển thị:
    Theo trình tự lấy thông tin
+ Tham khảo:
*/
SELECT 
    cc.card_company_id AS "クレジットカード会社 ID"
    ,cc.card_company_id AS "クレジット会社名"
    ,mc.expire_year || '/' || MAX(mc.expire_month) AS "有効期限(YY/MM)"
    ,mc.card_number AS "カード番号"
    ,m.member_id AS "会員 ID"
    ,m.first_name || m.last_name AS "氏名"
FROM
    member_card AS mc
    LEFT JOIN member AS m
        ON mc.member_id = m.member_id
    LEFT JOIN card_company AS cc
        ON mc.card_company_id = cc.card_company_id
WHERE 
    mc.expire_year = (SELECT
                           MAX(expire_year)
                        FROM 
                           member_card
                      )
GROUP BY 
    cc.card_company_id
    ,mc.expire_year
    ,mc.card_number
    ,m.member_id
;

 * postgresql://postgres:***@153.92.214.210:5432/er_sample
1 rows affected.

[('RKTN', 'RKTN', '16/11', '7777-7777-7777-7777', 'M007', '美和子平井')]